app/Controllers/Evento.php

INSERT INTO `ci_evento` (`id_usuario`, `nombre_evento`, `descripcion_evento`, `fecha_evento`, `estado_evento`) VALUES (2, 'Curso de Codeigniter 4', 'Curso de Codeigniter 4, Curso de Codeigniter 4, Curso de Codeigniter 4, Curso de Codeigniter 4', '2023-05-11', 'ACTIVO')
---
    public function insertarEvento()
    {
        $validation = \Config\Services::validation();

        // var_dump($this->request->getPost());

        $validation->setRule('nombre_evento', 'nombre evento', 'required|min_length[10]|max_length[550]');
        $validation->setRule('descripcion_evento', 'descripcion evento', 'min_length[10]|max_length[550]');
        $validation->setRule('fecha_evento', 'fecha evento', 'required|valid_date');
        $validation->setRule('estado_evento', 'estado evento', ['required', 'in_list[ACTIVO,INACTIVO]']);

        if ($validation->withRequest($this->request)->run()) {
            $idEvento = $this->eventoModel->save([
                'id_usuario' => user_id(),
                'nombre_evento' => $this->request->getPost('nombre_evento'),
                'descripcion_evento' => $this->request->getPost('descripcion_evento'),
                'fecha_evento' => $this->request->getPost('fecha_evento'),
                'estado_evento' => $this->request->getPost('estado_evento')
            ]);

SELECT `id_evento`, `nombre_evento`, `descripcion_evento`, `fecha_evento`, `descripcion_evento`, `username`, `estado_evento`
FROM `ci_evento`
JOIN `users` ON `ci_evento`.`id_usuario` = `users`.`id`
WHERE `estado_evento` = 'INACTIVO'
---
    public function listarEvento($estadoEvento = '')
    {
        // $eventoFiltrado = $this->eventoModel->where(['estado_evento' => $estadoEvento])->findAll();
        $estadoEvento =  $estadoEvento == '' ? ['id_usuario' => user_id()] : ['estado_evento' => $estadoEvento];
        $eventoFiltrado = $this->eventoModel->listarEvento('id_evento, nombre_evento, descripcion_evento,fecha_evento, descripcion_evento, username, estado_evento', $estadoEvento);
        $eventoFiltrado = $eventoFiltrado->get()->getResultArray();