app/Controllers/Participante.php

    public function insertarParticipante()
    {
        $validation = \Config\Services::validation();

        $validation->setRule('id_evento', 'numero evento', 'required|is_natural_no_zero');
        $validation->setRule('nombres', 'nombres', 'required|min_length[2]|max_length[45]');
        $validation->setRule('apellidos', 'apellidos', 'required|min_length[3]|max_length[45]');
        $validation->setRule('celular', 'celular', 'required|is_natural_no_zero|exact_length[8]');
        $validation->setRule('correo_electronico', 'correo electrónico', ['required', 'valid_email']);

        $correoElectronico = array_column($this->participanteModel->findAll(), 'correo_electronico');
---
SELECT *
FROM `ci_participante`

    public function editarParticipante($idEvento, $idParticipante)
    {
        $participante = $this->participanteModel->find($idParticipante);
---
SELECT *
FROM `ci_participante`
WHERE `ci_participante`.`id_participante` = '36'

    public function actualizarParticipante()
    {
        $validation = \Config\Services::validation();

        $validation->setRule('id_evento', 'numero evento', 'required|is_natural_no_zero');
        $validation->setRule('nombres', 'nombres', 'required|min_length[2]|max_length[45]');
        $validation->setRule('apellidos', 'apellidos', 'required|min_length[3]|max_length[45]');
        $validation->setRule('celular', 'celular', 'required|is_natural_no_zero|exact_length[8]');
        $validation->setRule('correo_electronico', 'correo electrónico', ['required', 'valid_email']);


        if ($validation->withRequest($this->request)->run()) {
            $esCorrecto = $this->participanteModel->update($this->request->getPost('id_participante'), [
                'id_evento' => $this->request->getPost('id_evento'),
                'nombres' => $this->request->getPost('nombres'),
                'apellidos' => $this->request->getPost('apellidos'),
                'celular' => $this->request->getPost('celular'),
                'ci_participante' => $this->request->getPost('ci_participante'),
                'correo_electronico' => $this->request->getPost('correo_electronico'),
            ]);
---
UPDATE `ci_participante` SET `id_evento` = '35', `nombres` = 'Cecilio', `apellidos` = 'Mamani', `celular` = '78877502', `correo_electronico` = 'emiliomamani@hotmail.com'
WHERE `ci_participante`.`id_participante` IN ('36')